# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [2]:
#Your code here
import pandas as pd
import sqlite3

conn = sqlite3.Connection('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [10]:
#Your code here
cur.execute('''SELECT firstname FROM employees join offices using(officeCode) WHERE city = 'Boston';''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

  firstName
0     Julie
1     Steve

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [15]:
#Your code here
cur.execute('''SELECT city, count(*) FROM offices left join employees using(officeCode) GROUP BY city;''')
df = pd.DataFrame(cur.fetchall())
df

               0  1
0         Boston  2
1         London  2
2            NYC  2
3          Paris  5
4  San Francisco  6
5         Sydney  4
6          Tokyo  2

## Write 3 Questions of your own and answer them

In [20]:
# Answers will vary
#How many Products are in each Product Line
cur.execute('''SELECT productLine, count(productCode) as num_products FROM productlines JOIN products using(productLine) GROUP BY 1;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

        productLine  num_products
0      Classic Cars            38
1       Motorcycles            13
2            Planes            12
3             Ships             9
4            Trains             3
5  Trucks and Buses            11
6      Vintage Cars            24

In [24]:
# Your code here
#Top 10 Customers (by number of orders)
cur.execute('''SELECT customerNumber, count(orderNumber) FROM customers JOIN orders USING(customerNumber) GROUP BY 1 ORDER BY count(orderNumber) DESC LIMIT 10;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

  customerNumber  count(orderNumber)
0            141                  26
1            124                  17
2            114                   5
3            145                   5
4            148                   5
5            323                   5
6            353                   5
7            119                   4
8            121                   4
9            128                   4

In [27]:
# Your code here
#Top 10 customers (by amount)
cur.execute('''SELECT customerNumber, sum(amount) from payments GROUP BY 1 ORDER BY sum(amount) DESC LIMIT 10;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

  customerNumber  sum(amount)
0            141    715738.98
1            124    584188.24
2            114    180585.07
3            151    177913.95
4            148    156251.03
5            323    154622.08
6            187    148410.09
7            276    137034.22
8            321    132340.78
9            146    130305.35

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold

In [ ]:
# Your code here

## Level Up: Display the Number of Products each employee has sold

In [ ]:
# Your code here

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!